// import * from "./9+.js" 


describe('9 exercise', ()=>{
    before(()=>{
        cy.visitCrmPage('9638700821', 'employee',"dev", "administration?tab=%D0%91%D0%B0%D0%BD%D0%BD%D0%B5%D1%80%D1%8B")  
    })
    
it('2 ex', ()=>{
   // встать в работу сборщиком
    })
it('3 ex', ()=>{
      // выбрать магазин
    })
it('4 ex', ()=>{
        // создать заказ
      })
it('5 ex', ()=>{
        // авторизоваться в диспетчерской
      })
it('6 ex', ()=>{
        // Перейти в раздел заказы
      }) 
it('7 ex', ()=>{
        // найти созданный заказ по id
      })
it('8 ex', ()=>{
        // открыть карточку заказа
      })
it('9 ex', ()=>{
        // перевести заказ в сборку, назначив сборщика 
      })
it('10 ex', ()=>{
        // статус заказа сборка
      })
it('11 ex', ()=>{
        // собрать все товары используя цикл. На каждой итерации проверять, что после сборки товара, статус изменился на собран
      })
it('12 ex', ()=>{
        // Перевести заказ в фасовку
      })
it('13 ex', ()=>{
        // статус фасовка
      })
it('14 ex', ()=>{
        // завершить фасовку
      })
it('15 ex', ()=>{
        // статус "готов к выдаче"
      })
})